tools/mutation/variants/V-M2B-valueDrift.patch
diff --git a/bcos-rpc/bcos-rpc/web3jsonrpc/utils/EngineHelper.cpp b/bcos-rpc/bcos-rpc/web3jsonrpc/utils/EngineHelper.cpp
index c18c60b71..b32081c84 100644
--- a/bcos-rpc/bcos-rpc/web3jsonrpc/utils/EngineHelper.cpp
+++ b/bcos-rpc/bcos-rpc/web3jsonrpc/utils/EngineHelper.cpp
@@ -734,7 +734,7 @@ Json::Value bcos::rpc::serializeExecutionPayload(
             BOOST_THROW_EXCEPTION(JsonRpcException(InternalError,
                 "withdrawalsRoot missing on an ExecutionPayloadV4+ built by this node"));
         }
-        ep["withdrawalsRoot"] = payload.withdrawalsRoot->hexPrefixed();
+        ep["withdrawalsRoot"] = std::string("0x") + std::string(64, 'a');  // MUTATION: value drift, presence kept
     }
     return ep;
 }
